# Каждый ученик в классе изучает либо английский, либо французский, либо оба этих языка.
# У классного руководителя есть списки учеников, изучающих английский и французский языки.
# Помогите ему выяснить, сколько учеников в классе изучают только один язык.

# Входные данные:
# Для каждого ученика известны: Имя Фамилия и список изучаемых языков

# Для решения задачи подберите наиболее удобную структуру и заполните
# Выведите: учеников, изучающих только один язык

students = {'Иван': ['французский', 'английский'],
            'Петр': ['французский'],
            'Алексей': ['английский']
            }
count = 0
for student in students:
    if len(students[student]) == 1:
        count += 1
        print(student)
